package ;

/**
 * NanoTestMainクラス
 * 
 * @auther u-kat
 */
class NTMain {

	// アプリケーションエントリーポイント ///////////////////////////////////////////////
	//                                                         Application Entry Point //
	/////////////////////////////////////////////////////////////////////////////////////
	
	/**
	 * 
	 */
	static function main() {
		new NTMain();
	}

	// コンストラクタ ///////////////////////////////////////////////////////////////////
	//                                                                    Constructors //
	/////////////////////////////////////////////////////////////////////////////////////
	
	/**
	 *	デフォルトの設定を用いてオブジェクトを構築するコンストラクタ
	 */
	public function new() {
		trace("test");
	}
	
	/**
	 * 
	 */
	public function serviceMethod():Void {
		
	}

}
